test/integration/data.containerHostSystem/request-5.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <RetrievePropertiesEx xmlns="urn:vim25">
      <_this type="PropertyCollector">propertyCollector</_this>
      <specSet>
        <propSet>
          <type>ContainerView</type>
          <all>false</all>
          <pathSet>view</pathSet>
        </propSet>
        <objectSet>
          <obj type="ContainerView">session[2c525f73-9b33-390d-204a-89dce66ba301]526e5d75-764a-9e48-ef75-18b5138bd187</obj>
          <skip>false</skip>
        </objectSet>
      </specSet>
      <options>
        <maxObjects>1</maxObjects>
      </options>
    </RetrievePropertiesEx>
  </soapenv:Body>
</soapenv:Envelope>
